# Redshift - Challenge
* StelllarAlgo Data Science
* Ryan Kazmerik & Nakisa Rad
* June 8, 2022

## What we want to do:
1. Read the records from this table and display in a pandas dataframe
2. Create a new record in the table, following the format of the other records, then display only the new record in a dataframe
3. Update an existing record, then display the updated record in a dataframe
4. Delete the new record you created, and display all records in a dataframe to ensure it was deleted.

In [16]:
import boto3
import awswrangler as wr
import pandas as pd

In [17]:
! aws sso login --profile Stellaralgo-DataScienceAdmin

Attempting to automatically open the SSO authorization page in your default browser.
If the browser does not open or you wish to use a different device to authorize this request, open the following URL:

https://device.sso.us-east-1.amazonaws.com/

Then enter the code:

QGWH-JKTV
Successully logged into Start URL: https://stellaralgo.awsapps.com/start#/

### Connecting to Redshift QA-APP

In [30]:
session = boto3.session.Session(profile_name='Stellaralgo-DataScienceAdmin')
client = session.client('redshift')

CLUSTER = 'qa-app'
DBNAME = 'datascience'
USER = 'admin'

conn = wr.data_api.redshift.connect(
        cluster_id = CLUSTER,
        database =  DBNAME,
        db_user = USER
    )

print(f"GOT CONNECTION TO DATABASE: {CLUSTER} {DBNAME}")

GOT CONNECTION TO DATABASE: qa-app datascience

### Read the records from this table and display in a pandas dataframe

In [31]:
sql = f"""
        SELECT *
        FROM ds.dummytable
    """

df = wr.data_api.redshift.read_sql_query(
        sql = sql, 
        con = conn
    )
df.head()

,playerid,dob,gamesplayed,injured,position,name,numassists,numgoals,pointpercentage
0,11,1988-08-04,20,false,RW,Dale,24,21,2.1
1,12,1985-06-05,20,false,C,Skip,15,36,2.5
2,13,1985-03-15,15,true,LW,Sanders,20,30,1.9
3,14,1983-02-20,20,false,LD,Patty,38,12,1.5
4,15,1987-08-04,18,false,RD,Reynolds,16,6,0.8

### Create a new record in the table, following the format of the other records

In [32]:
insert_record = f"""
                INSERT INTO ds.dummytable (dob, gamesplayed, injured, position, name, numassists, numgoals, pointpercentage) 
                VALUES ('1992-08-23', 0, false, 'DS', 'Nakisa', 10, 18, 2.7)
                """
df_insert_record = wr.data_api.redshift.read_sql_query(
        sql = insert_record, 
        con = conn
    )

### Display only the new record in a dataframe

In [34]:
new_record = f'SELECT * FROM ds.dummytable WHERE playerid = 19'

df_new_record = wr.data_api.redshift.read_sql_query(
        sql = new_record, 
        con = conn
    )

df_new_record

,playerid,dob,gamesplayed,injured,position,name,numassists,numgoals,pointpercentage
0,19,1992-08-23,0,false,DS,Nakisa,10,18,2.7

### Update an existing record

In [36]:
update_statement = f"""
        UPDATE ds.dummytable
        SET numassists = 12
        WHERE playerid = 19
    """

df_update_statement = wr.data_api.redshift.read_sql_query(
        sql = update_statement, 
        con = conn
    )

### Display the updated record in a dataframe

In [37]:
updated_record = f'SELECT * FROM ds.dummytable WHERE playerid = 19'

df_updated_record = wr.data_api.redshift.read_sql_query(
        sql = new_record, 
        con = conn
    )

df_updated_record

,playerid,dob,gamesplayed,injured,position,name,numassists,numgoals,pointpercentage
0,19,1992-08-23,0,false,DS,Nakisa,12,18,2.7

### Delete the new record you created

In [38]:
delete_statement = f"""
        DELETE FROM ds.dummytable
        WHERE playerid = 19
    """

df_delete_statement = wr.data_api.redshift.read_sql_query(
        sql = delete_statement, 
        con = conn
    )

### Display all records in a dataframe to ensure it was deleted

In [39]:
all_records = f'SELECT * FROM ds.dummytable'

df_all_records = wr.data_api.redshift.read_sql_query(
        sql = all_records, 
        con = conn
    )

df_all_records

,playerid,dob,gamesplayed,injured,position,name,numassists,numgoals,pointpercentage
0,11,1988-08-04,20,false,RW,Dale,24,21,2.1
1,12,1985-06-05,20,false,C,Skip,15,36,2.5
2,13,1985-03-15,15,true,LW,Sanders,20,30,1.9
3,14,1983-02-20,20,false,LD,Patty,38,12,1.5
4,15,1987-08-04,18,false,RD,Reynolds,16,6,0.8